# AddSeparator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComboBox..::..AddSeparator Method
ComboBox Class See Also
---
Adds a separator to the drop-down list.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void AddSeparator()
```

Visual Basic
---
```text
Public Sub AddSeparator
```

Visual C++
---
```text
public:
void AddSeparator()
```

# Remarks
The separator will be added below the last added member.
# See Also
ComboBox Class
Autodesk.Revit.UI Namespace